In [61]:
import pandas as pd
import numpy as np

In [62]:
# normal dağılımdan rastgele sayı matrix'i verir
data = np.random.randn(4,3)

In [63]:
data

array([[ 0.60163865,  1.10344061,  1.48693318],
       [ 0.44852327,  0.14258283,  1.35401108],
       [-1.14465043, -0.20026335,  0.94152896],
       [-0.42879879,  0.89891687,  0.57214577]])

In [64]:
dataFrame = pd.DataFrame(data)

In [65]:
dataFrame[0]

0    0.601639
1    0.448523
2   -1.144650
3   -0.428799
Name: 0, dtype: float64

In [66]:
dataFrame

          0         1         2
0  0.601639  1.103441  1.486933
1  0.448523  0.142583  1.354011
2 -1.144650 -0.200263  0.941529
3 -0.428799  0.898917  0.572146

In [67]:
yeniDataFrame = pd.DataFrame(data,index=["Recep","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","CalismaSaati"])

In [68]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [69]:
yeniDataFrame["Yas"]

Recep     1.103441
Zeynep    0.142583
Atlas    -0.200263
Mehmet    0.898917
Name: Yas, dtype: float64

In [70]:
yeniDataFrame["CalismaSaati"]

Recep     1.486933
Zeynep    1.354011
Atlas     0.941529
Mehmet    0.572146
Name: CalismaSaati, dtype: float64

In [71]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Recep   0.601639  1.103441
Zeynep  0.448523  0.142583
Atlas  -1.144650 -0.200263
Mehmet -0.428799  0.898917

In [72]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [73]:
yeniDataFrame.loc["Recep"] # satırdan veri çektik, normalde sütundn çekiyordu

Maas            0.601639
Yas             1.103441
CalismaSaati    1.486933
Name: Recep, dtype: float64

In [74]:
yeniDataFrame.loc["Zeynep"]

Maas            0.448523
Yas             0.142583
CalismaSaati    1.354011
Name: Zeynep, dtype: float64

In [75]:
yeniDataFrame.iloc[1] # index odaklı loc'lama

Maas            0.448523
Yas             0.142583
CalismaSaati    1.354011
Name: Zeynep, dtype: float64

In [76]:
yeniDataFrame["Maas"]

Recep     0.601639
Zeynep    0.448523
Atlas    -1.144650
Mehmet   -0.428799
Name: Maas, dtype: float64

In [77]:
yeniDataFrame["EmeklilikYasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [78]:
yeniDataFrame

            Maas       Yas  CalismaSaati  EmeklilikYasi
Recep   0.601639  1.103441      1.486933       2.206881
Zeynep  0.448523  0.142583      1.354011       0.285166
Atlas  -1.144650 -0.200263      0.941529      -0.400527
Mehmet -0.428799  0.898917      0.572146       1.797834

In [79]:
yeniDataFrame.drop("EmeklilikYasi",axis = 1) # sütundan eleman silmek için axis = 1 kullanılır

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [80]:
# satır da (row) yazmasak da default olarak zaten satır üzerinde arıyor ilk, ne olur olmaz yazdık
yeniDataFrame.drop("Mehmet",axis = 0)

            Maas       Yas  CalismaSaati  EmeklilikYasi
Recep   0.601639  1.103441      1.486933       2.206881
Zeynep  0.448523  0.142583      1.354011       0.285166
Atlas  -1.144650 -0.200263      0.941529      -0.400527

In [81]:
yeniDataFrame

            Maas       Yas  CalismaSaati  EmeklilikYasi
Recep   0.601639  1.103441      1.486933       2.206881
Zeynep  0.448523  0.142583      1.354011       0.285166
Atlas  -1.144650 -0.200263      0.941529      -0.400527
Mehmet -0.428799  0.898917      0.572146       1.797834

In [82]:
yeniDataFrame.drop("EmeklilikYasi", axis = 1, inplace=True) # kalıcı olarak silmesini sağlamak için inplace kullanılıyor

In [83]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [84]:
yeniDataFrame.loc["Recep"]["Yas"] # Recep'in yasi

1.103440611920274

In [85]:
yeniDataFrame.loc["Atlas","Yas"] # böyle de getiriliyor

-0.2002633549645242

In [86]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [92]:
booleanFrame = yeniDataFrame < 0 # o'dan küçük değerleri yeni değişkene atadık

In [93]:
booleanFrame

         Maas    Yas  CalismaSaati
Recep   False  False         False
Zeynep  False  False         False
Atlas    True   True         False
Mehmet   True  False         False

In [94]:
yeniDataFrame[booleanFrame]

            Maas       Yas  CalismaSaati
Recep        NaN       NaN           NaN
Zeynep       NaN       NaN           NaN
Atlas  -1.144650 -0.200263           NaN
Mehmet -0.428799       NaN           NaN

In [95]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  CalismaSaati
Recep        NaN       NaN           NaN
Zeynep       NaN       NaN           NaN
Atlas  -1.144650 -0.200263           NaN
Mehmet -0.428799       NaN           NaN

In [97]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] # yas kolonunda sadece 0 dan büyük değerleri getir atlas gelmedi mesela

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Mehmet -0.428799  0.898917      0.572146

In [99]:
yeniDataFrame[yeniDataFrame["CalismaSaati"] > 0]

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [102]:
yeniDataFrame.reset_index() # index'leri sıfırlıyor

    index      Maas       Yas  CalismaSaati
0   Recep  0.601639  1.103441      1.486933
1  Zeynep  0.448523  0.142583      1.354011
2   Atlas -1.144650 -0.200263      0.941529
3  Mehmet -0.428799  0.898917      0.572146

In [103]:
yeniDataFrame

            Maas       Yas  CalismaSaati
Recep   0.601639  1.103441      1.486933
Zeynep  0.448523  0.142583      1.354011
Atlas  -1.144650 -0.200263      0.941529
Mehmet -0.428799  0.898917      0.572146

In [104]:
yeniIndeksListesi = ["Rec","Zey","Atl","Meh"]

In [106]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi # column olarak ekledik yeni değerler

In [107]:
yeniDataFrame

            Maas       Yas  CalismaSaati Yeni Indeks
Recep   0.601639  1.103441      1.486933         Rec
Zeynep  0.448523  0.142583      1.354011         Zey
Atlas  -1.144650 -0.200263      0.941529         Atl
Mehmet -0.428799  0.898917      0.572146         Meh

In [109]:
yeniDataFrame.set_index("Yeni Indeks") # Yeni Indeks'i row'a çektik

                 Maas       Yas  CalismaSaati
Yeni Indeks
Rec          0.601639  1.103441      1.486933
Zey          0.448523  0.142583      1.354011
Atl         -1.144650 -0.200263      0.941529
Meh         -0.428799  0.898917      0.572146

In [117]:
yeniDataFrame

                 Maas       Yas  CalismaSaati
Yeni Indeks
Rec          0.601639  1.103441      1.486933
Zey          0.448523  0.142583      1.354011
Atl         -1.144650 -0.200263      0.941529
Meh         -0.428799  0.898917      0.572146

In [118]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)# kalıcı olmasını sağladık

KeyError: "None of ['Yeni Indeks'] are in the columns"

In [119]:
yeniDataFrame

                 Maas       Yas  CalismaSaati
Yeni Indeks
Rec          0.601639  1.103441      1.486933
Zey          0.448523  0.142583      1.354011
Atl         -1.144650 -0.200263      0.941529
Meh         -0.428799  0.898917      0.572146

In [120]:
yeniDataFrame.loc["Rec"]

Maas            0.601639
Yas             1.103441
CalismaSaati    1.486933
Name: Rec, dtype: float64

## MultiIndex

In [121]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [122]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [123]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [124]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [125]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks) # birlestirme islemi

In [126]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [127]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [128]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [130]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index = birlesmisIndeks, columns = ["Yas","Meslek"])

In [131]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [132]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [133]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [134]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [135]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [138]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"] # isim verdik

In [139]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F